BASE_URL = 'https://ez-route.stand.praktikum-services.ru/'

# предустановленные адреса:
ADDRESS1 = 'Хамовнический вал, 34'
ADDRESS2 = 'Зубовский бульвар, 37'

EQUAL_ROUTE_TEXT = 'Авто Бесплатно'
EQUAL_ROUTE_DURATION = 'В пути 0 мин.'

TEXT_TYPE_FAST = 'Вызвать такси'

RATE_TYPE_LIST = ['Глянцевый', 'Отпускной', 'Рабочий', 'Разговорчивый', 'Сонный', 'Утешительный']

RATES = [
    ("Глянцевый", "Если нужно блистать"),
    ("Отпускной", "Если пришла пора отдохнуть"),
    ("Рабочий", "Для деловых особ, которых отвлекают"),
    ("Разговорчивый", "Если мысли не выходят из головы"),
    ("Сонный", "Для тех, кто не выспался"),
    ("Утешительный", "Если хочется свернуться калачиком")]

CUST_PHONE = 'Телефон'
PAY_METHOD = 'Способ оплаты'
DRIVER_COMMENT = 'Комментарий водителю...'
ORDER_REQUIREMENTS = 'Требования к заказу'

WORKING = "Рабочий"
